window.addEventListener('DOMContentLoaded', () => {
    const menu = document.querySelector('.header__menu'),
    menuItem = document.querySelectorAll('.menu-item'),
    hamburger = document.querySelector('.hamburger');
    overlay = document.querySelector('.header__overlay');

    hamburger.addEventListener('click', () => {
        hamburger.classList.toggle('hamburger-active');
        menu.classList.toggle('header__menu-active');
        overlay.classList.toggle('header__overlay-active');
    });

    overlay.addEventListener('click', () => {
        hamburger.classList.remove('hamburger-active');
        menu.classList.remove('header__menu-active');
        overlay.classList.remove('header__overlay-active');
    });
})



const langButtons = document.querySelectorAll("[data-btn]");
const allLangs = ["ua", "ru"];
const currentPathName = window.location.pathname;
let currentLang =
	localStorage.getItem("language") || checkBrowserLang() || "ua";
let currentTexts = {};

const homeTexts = {
	"home_title-head": {
		ua:"Еротичний масаж у Дніпрі | Чоловічий салон 69",
		ru:"Эротический массаж в Днепре | Мужской салон 69",
	},
	"home_salon": {
		ua:"Про салон",
		ru:"О салоне",
	},
	"home_services": {
		ua:"Ціни еротичного масажу",
		ru:"Цены еромассажей",
	},
	"home_girls": {
		ua:"Дівчата",
		ru:"Девочки",
	},
	"home_interior": {
		ua:"Інтер'єр",
		ru:"Интерьер",
	},
	"home_info": {
		ua:"Контакти",
		ru:"Контакты",
	},
	"home_vacancies": {
		ua:"Вакансії",
		ru:"Вакансии",
	},
    "home_title-main": {
        ua: "Еротичний масаж у Дніпрі від провідного салону релаксуючих еротичних процедур '69'",
        ru: "Эротический массаж в Днепре от ведущего салона релаксирующих эротических процедур '69'",
    },
	"home_title-about": {
		ua:"Про нас",
		ru:"О нас",
	},
	"home_descr-w": {
		ua:"Хочемо звернути Вашу увагу на послуги нашого салону '69' у Дніпрі, адже ми надаємо можливість відпочити та насолодитися еротичним масажем. Наш салон завжди гостинно вітає нових та постійних клієнтів. Постійним відвідувачам доступні знижки як на звичайні, так і на нові види масажів. Отримайте VIP-статус, щоб відкрити усі таємниці масажного мистецтва. Еротичний масаж Дніпро від нас сподобається кожному. Після масажу Ви відчуєте повний релакс і забудете про всі справи. Атмосфера салону дозволить Вам відірватися від міської суєти. Наші досвідчені масажистки знають, як робити масаж, щоб Ви почували себе надзвичайно задоволеними і хотіли повертатися знову і знову.<br><br>Еротичний масаж - це мистецтво, яке допомагає розкрити найчутливіші точки тіла і отримати максимальну насолоду. У нашому салоні '69' фахівці використовують ефірні олії та приємну музику для створення релаксуючої атмосфери. Поцілунки та ніжні дотики також є важливою частиною еротичного масажу. Наш салон для чоловіків - це місце, де Ви можете забути про проблеми на певний час і насолодитися енергією та насолодою. Досвідчені масажистки допоможуть Вам розслабитися і відчути найвищу точку задоволення.<br><br>Салон '69' у Дніпрі - це місце, де Ви можете не лише відпочити, а й відкрити для себе нові відчуття. Наші масажистки допоможуть Вам відчути справжню бурю емоцій і виплеснути її разом з Вами в одній хвилі. Еротичний масаж у нашому салоні включає в себе масаж різних частин тіла, і професійні масажистки знають, як  зробити, щоб ви почували себе розслабленими та отримали максимальну насолоду. Головне - це дозволити собі розслабитися і насолодитися моментом, дозволяючи масажисткам дарувати Вам незабутні відчуття. З ніжними руками і пристрасним дотиком ви отримаєте максимальне задоволення від чутливого масажу. Сексуальна енергія виходить на поверхню, і це нормально. Головне - це дати їй вільно проявитися.<br><br>Салон '69' на Проспекті Дмитра Яворницького - це місце, де Ви зарядитеся енергією та забудете про напружені будні. Еротичний масаж допомагає не лише насолодитися, але й підтримувати здоров'я у тонусі. Масаж розслабляє і допомагає забути про проблеми, а вмілі руки масажисток зроблять масаж всіх зон Вашого тіла. Сексуальне здоров'я також підтримується завдяки масажу. Ми допоможемо вам розкрити свій сексуальний потенціал і досягти вищих точок насолоди. Вартість еротичного масажу визначається типом масажу та тривалістю сеансу. Ми пропонуємо різні види масажу для вибору. Для наших постійних клієнтів є знижки і бонуси. Якщо ви хочете подарувати незабутні емоції, можна придбати подарунковий сертифікат нашого салону масажу.<br><br>Наші масажистки вміють робити будь-який вид масажу, котрий точно сподобається Вам. Для тих, хто бажає відкрити нові відчуття, ми пропонуємо масаж для подружніх пар. Це допоможе зблизити вас та зміцнити ваші стосунки, одночасно насолоджуючись максимальним задоволенням. Наші масажистки мають багатий досвід роботи і знають усі чутливі точки тіла, які гарантують вам справжню бурю насолоди і задоволення. Усі ціни наведено на нашому веб-сайті і можуть варіюватися залежно від часу, кількості масажисток та виду масажу. Еротичний масаж Дніпро - Ваша зона релаксу!",
		ru:"Хотим обратить Ваше внимание на услуги нашего салона '69' в Днепре, ведь мы предоставляем возможность отдохнуть и насладиться эротическим массажем. Наш салон всегда приветствует новых и постоянных клиентов. Постоянным посетителям доступны скидки как на обычные, так и новые виды массажей. Получите VIP-статус, чтобы открыть все тайны массажного искусства. Эротический массаж «Днепр» от нас понравится каждому. После массажа Вы почувствуете полный релакс и забудете обо всех делах. Атмосфера салона позволит Вам оторваться от городской суеты. Наши опытные массажистки знают, как делать массаж, чтобы Вы чувствовали себя чрезвычайно довольными и хотели возвращаться снова и снова. <br><br>Эротический массаж - это искусство, которое помогает раскрыть самые чувствительные точки тела и получить максимальное наслаждение. В нашем салоне '69' специалисты используют эфирные масла и приятную музыку для создания релаксирующей атмосферы. Поцелуи и нежные прикосновения являются также важной частью эротического массажа. Наш салон для мужчин – это место, где Вы можете забыть о проблемах и насладиться энергией и атмосферой. Опытные массажистки помогут Вам расслабиться и почувствовать самую высокую точку удовольствия. <br><br>Салон '69' в Днепре - это место, где Вы можете не только отдохнуть, но и открыть для себя новые ощущения. Наши массажистки помогут Вам почувствовать настоящую бурю эмоций и выплеснуть ее вместе с Вами в одной волне. Эротический массаж в нашем салоне включает в себя массаж различных частей тела, а наши профессиональные массажистки знают, что нужно сделать, чтобы Вы чувствовали себя расслабленными и получили максимальное наслаждение. Главное – это позволить себе расслабиться и насладиться моментом, позволяя массажисткам дарить Вам незабываемые ощущения. С нежными руками и страстным прикосновением Вы получите максимальное удовольствие от чувствительного массажа. Сексуальная энергия выходит на поверхность и это нормально. Главное - это дать ей свободно проявиться. <br><br>Салон '69' на Проспекте Дмитрия Яворницкого - это место, где Вы зарядитесь энергией и забудете о напряженных буднях. Эротический массаж помогает не только насладиться, но и поддерживать здоровье в тонусе. Массаж расслабляет и помогает забыть о проблемах, а умелые руки массажисток сделают массаж всех зон Вашего тела. Сексуальное здоровье тоже поддерживается благодаря массажу. Мы поможем Вам раскрыть свой сексуальный потенциал и добиться высших точек наслаждения. Стоимость эротического массажа определяется типом массажа и продолжительностью сеанса. Мы предлагаем разные виды массажа для выбора. Для наших постоянных клиентов есть скидки и бонусы. Если вы хотите подарить незабываемые эмоции, можно приобрести подарочный сертификат нашего салона массажа. <br><br>Наши массажистки умеют делать любой вид массажа, который точно понравится Вам. Для тех, кто хочет открыть новые ощущения, мы предлагаем массаж для супружеских пар. Это поможет сблизить вас и укрепить ваши отношения, одновременно наслаждаясь максимальным удовольствием. Наши массажистки имеют богатый опыт работы и знают все чувствительные точки тела, гарантирующие вам настоящую бурю наслаждения и удовольствия. Все цены приведены на нашем сайте и могут варьироваться в зависимости от времени, количества массажисток и вида массажа. Эротический массаж Днепр – Ваша зона релакса!",
	},
	"home_services-title": {
		ua:"Опис масажів",
		ru:"Описание массажей",
	},
	"home_services-h1": {
		ua:"Експрес-Боді",
		ru:"Экспресс-Боди",
	},
	"home_services-p1": {
		ua:"Час: 30хв Ціна: 900грн",
		ru:"Время: 30мин Цена: 900грн",
	},
	"home_services-d1": {
		ua:"У цій програмі можна вибрати або еротичний масаж, або класичний",
		ru:"В этой программе можно выбрать либо эротический массаж, либо классический",
	},
	"home_services-h2": {
		ua:"Еротичний комплексний масаж",
		ru:"Эротический комплексный массаж",
	},
	"home_services-p2": {
		ua:"Час: 60хв Ціна: 1800грн",
		ru:"Время: 60мин Цена: 1800грн",
	},
	"home_services-d2": {
		ua:"Комплексний масаж усього тіла, еротичний масаж та Ваше розслаблення",
		ru:"Комплексный массаж всего тела, эротический массаж и Ваше расслабление",
	},
	"home_services-h3": {
		ua:"Еротичний масаж (2 релакси)",
		ru:"Эротический массаж (2 релакса)",
	},
	"home_services-p3": {
		ua:"Час: 90хв Ціна: 2700грн",
		ru:"Время: 90мин Цена: 2700грн",
	},
	"home_services-d3": {
		ua:"Відверта програма з двома релаксами та комплексним масажем",
		ru:"Откровенная программа с двумя релаксами и комплексным массажем",
	},
	"home_services-h4": {
		ua:"Абсолютний Релакс",
		ru:"Абсолютный Релакс",
	},
	"home_services-p4": {
		ua:"Час: 60хв Ціна: 3000грн",
		ru:"Время: 60мин Цена: 3000грн",
	},
	"home_services-d4": {
		ua:"Класичний масаж, еротичний масаж, 2 релакси, чіпати дівчину можна скрізь",
		ru:"Классический массаж, эротический массаж, 2 релакса, трогать девушку можно везде",
	},
	"home_services-h5": {
		ua:"VIP Релакс",
		ru:"VIP Релакс",
	},
	"home_services-p5": {
		ua:"Час: 120хв Ціна: 4000грн",
		ru:"Время: 120мин Цена: 4000грн",
	},
	"home_services-d5": {
		ua:"2 години еротичного масажу необмежену кількість релаксів, година еротичного масажу, торкатися можна скрізь",
		ru:"2 часа эротического массажа неограниченное количество релаксов, час эротического массажа, прикасаться можно везде",
	},
	"home_services-h6": {
		ua:"VIP",
		ru:"VIP",
	},
	"home_services-p6": {
		ua:"Час: 120хв Ціна: 7000грн",
		ru:"Время: 120мин Цена: 7000грн",
	},
	"home_services-d6": {
		ua:"Шампанське, спа-душ з дівчиною, піп-шоу, еротичний масаж, класичний масаж, необмежену кількість релаксів + масаж голови та обличчя",
		ru:"Шампанское, спа-душ с девушкой, поп-шоу, эротический массаж, классический массаж, неограниченное количество релаксов + массаж головы и лица",
	},
	"home_services-h7": {
		ua:"VIP “69”",
		ru:"VIP “69”",
	},
	"home_services-p71": {
		ua:"Час: 60хв Ціна: 4000грн",
		ru:"Время: 60мин Цена: 4000грн",
	},
	"home_services-p72": {
		ua:"Час: 90хв Ціна: 5000грн",
		ru:"Время: 90мин Цена: 5000грн",
	},
	"home_services-d7": {
		ua:"Чудовий комплексний масаж, відверта еротика, шоу програма <br>(піп-шоу, стрип-шоу, до дівчинки можна торкатись скрізь + ласки для дівчини)",
		ru:"Великолепный комплексный массаж, откровенная эротика, шоу программа <br>(пип-шоу, стрип-шоу, к девочке можно прикасаться везде + ласки для девушки)",
	},
	"home_services-h8": {
		ua:"Дві перлини",
		ru:"Две жемчужины",
	},
	"home_services-p81": {
		ua:"Час: 30хв Ціна: 3000грн",
		ru:"Время: 30мин Цена: 3000грн",
	},
	"home_services-p82": {
		ua:"Час: 60хв Ціна: 4000грн",
		ru:"Время: 60мин Цена: 4000грн",
	},
	"home_services-p83": {
		ua:"Час: 90хв Ціна: 5600грн",
		ru:"Время: 90мин Цена: 5600грн",
	},
	"home_services-d8": {
		ua:"Відверта еротика, масаж у чотири руки, хороший комплексний масаж усього вашого тіла, два розслаблення",
		ru:"Откровенная эротика, массаж в четыре руки, хороший комплексный массаж всего вашего тела, два расслабления",
	},
	"home_services-h9": {
		ua:"VIP Дві перлини",
		ru:"VIP Две жемчужины",
	},
	"home_services-p91": {
		ua:"Час: 90хв Ціна: 5000грн",
		ru:"Время: 90мин Цена: 5000грн",
	},
	"home_services-p92": {
		ua:"Час: 120хв Ціна: 6000грн",
		ru:"Время: 120мин Цена: 6000грн",
	},
	"home_services-d9": {
		ua:"Шоу програма, відверта еротика, еротичний масаж, кількість релаксів необмежена <br>Можна торкатися до дівчини",
		ru:"Шоу программа, откровенная эротика, эротический массаж, количество релаксов неограниченное <br>Можно прикасаться к девушке",
	},
	"home_services-h10": {
		ua:"Для пар",
		ru:"Для пар",
	},
	"home_services-p101": {
		ua:"Час: 60хв Ціна: 4700грн <br>(масаж класичний, еротичний та релакс для чоловіків)",
		ru:"Время: 60мин Цена: 4700грн <br>(массаж классический, эротический и релакс для мужчин)",
	},
	"home_services-p102": {
		ua:"Час: 90хв Ціна: 5000грн <br>(Еротичний масаж,класичний масаж,відверта еротика,відверте піп-шоу,релакс для пари) <br>*шампанське у подарунок*",
		ru:"Время: 90мин Цена: 5000грн <br>(Эротический массаж,классический массаж,откровенная эротика,откровенное пип-шоу,релакс для пары)*шампанское в подарок*",
	},
	"home_services-h11": {
		ua:"Вся ніч (8 годин)",
		ru:"Вся ночь (8 часов)",
	},
	"home_home_services-p11": {
		ua:"Ціна: 30000грн",
		ru:"Цена: 30000грн",
	},
	"home_services-d11": {
		ua:"Класичний масаж, еротичний масаж, розслаблення, розмови для душі <br>За пів години до закінчення програми гість отримує сніданок у подарунок",
		ru:"Классический массаж, эротический массаж, расслабление, разговоры для души <br>За полчаса до окончания программы гость получает завтрак в подарок",
	},
	"home_services-h12": {
		ua:"Парубоцька вечірка",
		ru:"Мальчишник",
	},
	"home_services-d12": {
		ua:"Підберемо особливу програму під вашу компанію, пляшка віскі у подарунок + бутерброди з чорною ікрою",
		ru:"Подберем специальную программу под вашу компанию, бутылка виски в подарок + бутерброды с чёрной икрой",
	},
	"home_bonus-1": {
		ua:"Доповнення",
		ru:"Дополнение",
	},
	"home_bonus-2": {
		ua:"БДСМ-800грн",
		ru:"БДСМ-800грн",
	},
	"home_bonus-3": {
		ua:"Страпон-800грн",
		ru:"Страпон-800грн",
	},
	"home_bonus-4": {
		ua:"Поцілунок троянди-1000грн",
		ru:"Поцелуй розы-1000грн",
	},
	"home_bonus-5": {
		ua:"Фантазія-500грн",
		ru:"Фантазия-500грн",
	},
	"home_bonus-6": {
		ua:"Стриптиз-400грн",
		ru:"Стриптиз-400грн",
	},
	"home_bonus-7": {
		ua:"Піп шоу-400грн",
		ru:"Пип шоу-400грн",
	},
	"home_bonus-8": {
		ua:"Спа+Релакс-600грн",
		ru:"Спа+Релакс-600грн",
	},
	"home_bonus-9": {
		ua:"Відверта еротика-600грн",
		ru:"Откровенная эротика-600грн",
	},
	"home_bonus-10": {
		ua:"Бікіні-500грн",
		ru:"Бикини-500грн",
	},
	"home_bonus-11": {
		ua:"Душ із дівчиною-400грн",
		ru:"Душ с девушкой-400 грн",
	},
	"home_gr": {
		ua:"Топ-дівчата місяця",
		ru:"Топ-девушки месяца",
	},
	"home_gr-1": {
		ua:"Ліка",
		ru:"Лика",
	},
	"home_gr-2": {
		ua:"Віка",
		ru:"Вика",
	},
	"home_gr-3": {
		ua:"Діана",
		ru:"Диана",
	},
	"home_inter": {
		ua:"Інтер'єр",
		ru:"Интерьер",
	},
	"home_bar": {
		ua:"",
		ru:"",
	},
	"home_": {
		ua:"",
		ru:"",
	},
	"home_info-inv": {
		ua:"Приходьте до нас за адресою",
		ru:"Приходите к нам по адресу",
	},
	"home_info-descr": {
		ua:"м. Дніро, Проспект Дмитра Яворницького, 42",
		ru:"г. Днепр, Проспект Дмитрия Яворницкого, 42",
	},
};
const anotherTexts = {
	"another_title-head": {
		ua:"Еротичний масаж у Дніпрі | Чоловічий салон 69",
		ru:"Эротический массаж в Днепре | Мужской салон 69",
	},
	"another_salon": {
		ua:"Про салон",
		ru:"О салоне",
	},
	"another_services": {
		ua:"Ціни еротичного масажу",
		ru:"Цены еромассажей",
	},
	"another_girls": {
		ua:"Дівчата",
		ru:"Девочки",
	},
	"another_interior": {
		ua:"Інтер'єр",
		ru:"Интерьер",
	},
	"another_info": {
		ua:"Контакти",
		ru:"Контакты",
	},
	"another_vacancies": {
		ua:"Вакансії",
		ru:"Вакансии",
	},
    "another_title-main": {
        ua: "Еротичний масаж у Дніпрі від провідного салону релаксуючих еротичних процедур '69'",
        ru: "Эротический массаж в Днепре от ведущего салона релаксирующих эротических процедур '69'",
    },
	"another_title": {
		ua:"Вакансії",
		ru:"Вакансии",
	},
	"another_vac-header": {
		ua:"Вакансії масажисток у Дніпрі",
		ru:"Вакансии массажисток в Днепре",
	},
	"another_vac-descr": {
		ua:"Салон еротичного масажу «69» приймає на постійну роботу масажисток. <br><br>Вам більше 18 років, Ви привабливі, сексуальні, товариські, доброзичливі та хочете працювати масажисткою в одному з найкращих салонів еротичного масажу Дніпра? Якщо так, тоді будемо раді з Вами поспілкуватися. <br><br>Ми готові запропонувати майбутнім співробітницям роботу у затишному закладі, де панує безпечна, гостинна атмосфера. Строго без інтиму, конфіденційність гарантована. Ми постійно збільшуємо кількість клієнтів, тому гонорари наших дівчат справді гідні. <br><br>Більш детальну інформацію ви зможете отримати за:",
		ru:"Салон эротического массажа «69» принимает на постоянную работу массажисток. <br><br>Вам более 18 лет, Вы привлекательны, сексуальны, общительны, дружелюбны и хотите работать массажисткой в одном из лучших салонов эротического массажа Днепра? Если да, тогда будем рады с Вами пообщаться. <br><br>Мы готовы предложить будущим сотрудницам работу в уютном заведении, где царит безопасная, гостеприимная атмосфера. Строго без интима, конфиденциальность гарантирована. Мы постоянно увеличиваем количество клиентов, поэтому гонорары наших девушек действительно достойны. <br><br>Более подробную информацию вы сможете получить по:",
	},
	"another_info-inv": {
		ua:"Приходьте до нас за адресою",
		ru:"Приходите к нам по адресу",
	},
	"another_info-descr": {
		ua:"м. Дніро, Проспект Дмитра Яворницького, 42",
		ru:"г. Днепр, Проспект Дмитрия Яворницкого, 42",
	},
};

function checkPagePathName() {
    switch (currentPathName) {
        case "/index.html":
            currentTexts = homeTexts; 
            break;
        case "/main.html":
            currentTexts = homeTexts; 
            break;
        case "/vacancies.html":
            currentTexts = anotherTexts; 
            break;
    
        default:
            currentTexts = homeTexts;
            break;
    }
}
checkPagePathName();

function changeLang() {
	for (const key in currentTexts) {
		let elem = document.querySelector(`[data-lang=${key}]`);
		if (elem) {
			elem.innerHTML = currentTexts[key][currentLang];
		}
	}
}
changeLang();

langButtons.forEach((btn) => {
	btn.addEventListener("click", (event) => {
		if (!event.target.classList.contains("header__btn_active")) {
			currentLang = event.target.dataset.btn;
			localStorage.setItem("language", event.target.dataset.btn);
			resetActiveClass(langButtons, "header__btn_active");
			btn.classList.add("header__btn_active");
			changeLang();
		}
	});
});

function resetActiveClass(arr, activeClass) {
	arr.forEach((elem) => {
		elem.classList.remove(activeClass);
	});
}

// Проверка активной кнопки
function checkActiveLangButton() {
	switch (currentLang) {
        case "ua":
			document
				.querySelector('[data-btn="ua"]')
				.classList.add("header__btn_active");
			break;
		case "ru":
			document
				.querySelector('[data-btn="ru"]')
				.classList.add("header__btn_active");
			break;
		// case "de":
		// 	document
		// 		.querySelector('[data-btn="de"]')
		// 		.classList.add("header__btn_active");
		// 	break;

		default:
			document
				.querySelector('[data-btn="ua"]')
				.classList.add("header__btn_active");
			break;
	}
}
checkActiveLangButton();

// Проверка языка браузера
function checkBrowserLang() {
	const navLang = navigator.language.slice(0, 2).toLowerCase();
	const result = allLangs.some((elem) => {
		return elem === navLang;
	});
	if (result) {
		return navLang;
	}
}

console.log("navigator.language", checkBrowserLang());













// var arrLang = {
//     'ua': {
//       'about': 'Про салон',
//       'services': 'Ціни еротичного масажу',
//       'girls': 'Дівчата',
//       'interior': 'Інтер`єр',
//       'contacts': 'Контакти',
//       'vacancies': 'Вакансії',
//     },
//     'ru': {
//         'about': 'Про салон',
//         'services': 'Цены эротического массажа',
//         'girls': 'Девочки',
//         'interior': 'Интерьер',
//         'contacts': 'Контакты',
//         'vacancies': 'Вакансии',
//       },
//   }
  
//     $(function() {
//       $('.translate').click(function() {
//         var lang = $(this).attr('id');
  
//         $('.lang').each(function(index, item) {
//           $(this).text(arrLang[lang][$(this).attr('key')]);
//         });
//       });
//     });

